Tekla.Structures.Dialog.UIControls.WpfFilterCheckBox
The WpfFilterAttribute class represents a checkbox control for enabling/disabling
dialog attributes defined with StructuresFieldAttribute.

Tekla.Structures.Dialog.UIControls.WpfFilterCheckBox.#ctor
Initiates a new instance of the control.

Tekla.Structures.Dialog.UIControls.WpfFilterCheckBox.AttributeName
Dialog attribute name defined with StructuresFieldAttribute

Tekla.Structures.Dialog.UIControls.WpfFilterCheckBox.filter_Changed(System.Object,System.Windows.RoutedEventArgs)
Event to set the filter value
sender: The event sender.
e: The event arguments.